Assignment 4

In [1]:
# Ans 1:
import pandas as pd
print(pd.__version__)

1.1.4

In [2]:
# Ans 2:
import numpy as np
arr = np.array([12,54,23,65,81])
print(arr)
name = pd.Series(arr)
print(name)
type(name)

[12 54 23 65 81]
0    12
1    54
2    23
3    65
4    81
dtype: int64

pandas.core.series.Series

In [3]:
# Ans 3:
name = pd.DataFrame(name, index = ["b",'i','n','o','d'])
print(name)
col = name.index.values
print(col)
name['chars'] = col
print(name)

    0
b NaN
i NaN
n NaN
o NaN
d NaN
['b' 'i' 'n' 'o' 'd']
    0 chars
b NaN     b
i NaN     i
n NaN     n
o NaN     o
d NaN     d

In [4]:
# Ans 4:
import seaborn as sns
print(sns.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'tips', 'titanic']

In [5]:
data = sns.load_dataset('mpg')
print(data.shape)
data.head()

(398, 9)

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

In [6]:
# Ans 5: USA, Japan and Europe
data['origin'].unique()

array(['usa', 'japan', 'europe'], dtype=object)

In [7]:
# Ans 6:
print(data['origin'].value_counts())
print(data.shape)
data = data.loc[data['origin']=='usa']
print(data['origin'].value_counts())
print(data.shape)

usa       249
japan      79
europe     70
Name: origin, dtype: int64
(398, 9)
usa    249
Name: origin, dtype: int64
(249, 9)